---
kind: type
id: T:Autodesk.Revit.DB.Analysis.FieldDomainPoints
source: html/5b145517-1904-4b5f-2f66-0d84b259335b.htm
---
# Autodesk.Revit.DB.Analysis.FieldDomainPoints

Abstract base class for various classes of field domain points

## Syntax (C#)
```csharp
public class FieldDomainPoints : IDisposable
```